package main

// Commands
const (
	Cancel            = "🛑 انصراف 🛑"
	ConnectToAny      = "🔗 به یه ناشناس وصلم کن!"
	ConnectToSpecific = "💌 به مخاطب خاصم وصلم کن!"
	AnonymousToGroup  = "👥 پیام ناشناس به گروه"
	MyLinkCommand     = "لینک ناشناس من 📬"
	IncreaseAwards    = "🏆 افزایش امتیاز"
	HelpCommand       = "راهنما"
)

// Text messages
const (
	Canceled = `عملیات کنسل شد!`
	UserText = `
فرستنده: #%s`
	FormatNotSupported = `فرمت پیام پشتیبانی نمیشود :/`
	SpecialNotFound    = `متاسفانه مخاطب مورد نظر شما عضو نیست، ولی با یه کلکی اگر بتونی کاری کنه فقط یه بار به ما پیام بده
میتونی بهش ناشناس پیام بدی!`
	SpecialFind = `ایول مثل اینکه مخاطب خاصت عضوه😍 
👇👇
https://t.me/%s?start=%s`
	SentSuccessfully    = `باموفقیت ارسال شد!`
	DuplicateBlock      = `کاربر مورد نظر رو قبلا بلاک کردی!`
	ForbiddenMessage    = `کاربر دریافت کننده‌ی پیام بلاکت کرده 🙁 نمیتونی پیام بدی!`
	SuccessfulUnSuspend = `کاربر مورد نظر آنبلاک شد و میتونه دوباره پیام بده 🙃`
	SuccessfulSuspend   = `کاربر مورد نظر بلاک شد و دیگه نمیتونه بهت پیام بده!`
	SeenMessage         = `این پیامت ☝️ رو دید!`
	SendingReply        = `در حال پاسخ دادن به #%s هستی، پیام خودتو بنویس و ارسال کن برامون:`
	MessageNotFound     = `پیام مورد نظر یافت نشد :(`
	SpecificMessage     = `برای اینکه بتونم به مخاطب خاصت بطور ناشناس وصلت کنم، یکی از این ۲ کار رو انجام بده:

راه اول 👈 : Username@ یا همون آی‌دی تلگرام اون شخص رو الان وارد ربات کن!

راه دوم 👈 : الان یه پیام متنی از اون شخص به این ربات فوروارد کن تا ببینم عضو هست یا نه!`
	ToAnyGroup = `آماده‌ایم!
پیام رو همین‌جا بفرست تا به صورت ناشناس به گروهی که می‌خوای ارسال بشه...`
	ToAnyMessage = `در حال اتصال ... 
اگر تا حداکثر یک دقیقه آینده پیامی ارسال نشد دوباره تلاش کنید`
	HelpMessage = `🔎 راهنما
کافیه که روی دکمه‌های پایین صفحه بزنید`
	Awards = `اعتبار فعلی مکالمه شما : 45 گپ جدید


❓ چطور اعتبار مکالمه خودمو افزایش بدم ؟

ــــــــــــــــــــــــــــــــــــــــ

کافیه که افراد بیشتری وارد مکالمه بشن از طریق لینک شما
`
	IDontKnown = `متوجه نشدم :/

چه کاری برات انجام بدم`
	UserNotFound = `کاربر مورد نظر یافت نشد!`
	OkWhatIDo    = `حله!

چه کاری برات انجام بدم؟`
	ErrorOccured = `خطایی رخ داده است، لطفا دوباره امتحان کنید 😔`
	MyLink       = `سلام %s هستم ✋️

لینک زیر رو لمس کن و هر حرفی که تو دلت هست یا هر انتقادی که نسبت به من داری رو با خیال راحت بنویس و بفرست. بدون اینکه از اسمت باخبر بشم پیامت به من می‌رسه. خودتم می‌تونی امتحان کنی و از بقیه بخوای راحت و ناشناس بهت پیام بفرستن، حرفای خیلی جالبی می‌شنوی! 😉

👇👇
https://t.me/%s?start=%s`
	YouHaveNotNewMessage = `پیام نخونده‌ای نداری !
چطوره با زدن این دستور 👈 /link لینک خودت رو بگیری و به دوستات یا گروه‌ها بفرستی تا بتونند بهت پیام ناشناس بفرستند؟ 😊`
	NewMessage = `📬 شما یک پیام ناشناس جدید دارید !

جهت دریافت کلیک کنید 👈 /newmsg`
	YouCantSendToYourSelf = `شما نمینونید به خودتون پیام بدید :)`
	SendMessageStart      = `در حال ارسال پیام ناشناس به %s هستی.

می‌تونی هر حرف یا انتقادی که تو دلت هست رو بگی چون پیامت به صورت کاملا ناشناس ارسال می‌شه!`
)
